/* 

Ответы на задания.

•Какое будет выведено значение: 
let x = 5; 
alert( x++ ); 
Ответ: 6

•Чему равно такое выражение: 
[ ] + false - null + true 
Ответ: NaN

•Что выведет этот код: 
let y = 1; 
let x = y = 2; 
alert(x); ?
Ответ: 2

•Чему равна сумма 
[ ] + 1 + 2
Ответ: 12

•Что выведет этот код: 
alert( "1"[0] )
Ответ: 1

•Чему равно 
2 && 1 && null && 0 && undefined 
Ответ: null

•Есть ли разница между выражениями?
!!( a && b ) и (a && b)
Ответ: Нет. Двойное отрицание приводит к истине

•Что выведет этот код: 
alert( null || 2 && 3 || 4 ); 
Ответ: 3

•Правда ли что a == b
a = [1, 2, 3]; 
b = [1, 2, 3]; 
Ответ: Нет

•Что выведет этот код:
alert( +"Infinity" ); 
Ответ: infinity

•Верно ли сравнение:
"ёжик" > "яблоко"
Ответ: Да

•Чему равно 
0 || "" || 2 || undefined || true || falsе 
Ответ:2

*/
